{
  "backend/main.mo": "Implements an inquiry management canister with functions to submit inquiries, retrieve all or filtered inquiries, and store them in a map.",
  "feature_evidence.json": "Provides feature evidence metadata linking contact-section enhancements to specific frontend files and test requirements.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all frontend components, hooks, utilities, and styles used in the project.",
  "frontend/index.css": "Defines global Tailwind layers and OKLCH-based color variables for both light and dark themes.",
  "frontend/index.html": "Base HTML file that mounts the React app and loads the main entry script.",
  "frontend/src/App.tsx": "Main app component assembling the page layout with header, sections, and footer.",
  "frontend/src/components/site/BrandLogo.tsx": "Logo component that loads the NK SYSTECH image with a styled text fallback on error.",
  "frontend/src/components/site/ContactSection.tsx": "Contact section providing direct call/WhatsApp buttons and an inquiry form with validation and submission handling.",
  "frontend/src/components/site/Footer.tsx": "Footer showing branding, quick navigation links, and full contact and address details.",
  "frontend/src/components/site/Header.tsx": "Responsive header with logo, desktop navigation, and mobile sheet-based menu.",
  "frontend/src/components/site/HeroSection.tsx": "Hero banner with headline, description, CTA buttons, and scroll-to-section behavior.",
  "frontend/src/components/site/InquiryListDebug.tsx": "DEV-only collapsible panel showing a table of inquiries fetched from backend with loading and error states.",
  "frontend/src/components/site/ProductCategories.tsx": "Displays a grid of predefined product categories with items using cards.",
  "frontend/src/components/site/ScrollToSectionLink.tsx": "Accessible link component that smoothly scrolls to a target section on click or key press.",
  "frontend/src/components/site/Section.tsx": "Utility wrapper for page sections providing padding and container layout.",
  "frontend/src/components/site/ServicesSection.tsx": "Renders a services grid and technical work images inside a structured section.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInquiryList.ts": "Fetches inquiry list from backend using the actor, exposing loading, error, and refetch states.",
  "frontend/src/hooks/useInquirySubmission.ts": "Handles inquiry form validation and submission through the backend actor with status tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state, stored identity loading, and context for authentication.",
  "frontend/src/index.css": "Tailwind setup defining CSS variables for themes, base styles, and utility extensions.",
  "frontend/src/lib/serviceInterest.ts": "Defines service interest options and provides helpers to map between frontend values, backend enum values, and display labels.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Stores project metadata including version, summary, architectural notes, issues, and implemented features."
}