{
  "backend/main.mo": "Defines a canister for storing and retrieving inquiries with auto‑incremented IDs, filtering, and basic CRUD-like query methods.",
  "feature_evidence.json": "Contains feature-to-file mapping and metadata showing which frontend files implement specific product features.",
  "frontend-file-summaries.txt": "Lists short descriptions of all major frontend components, hooks, and styles for reference.",
  "frontend/index.css": "Global Tailwind CSS setup defining color variables, theming, and base styling for the site.",
  "frontend/index.html": "HTML entry point loading the React app into the root container.",
  "frontend/src/App.tsx": "Main layout component assembling Header, Hero, About, Services, Contact, and Footer sections.",
  "frontend/src/components/site/ContactSection.tsx": "Renders an inquiry form with validation, backend submission, status messaging, and optional debug list.",
  "frontend/src/components/site/Footer.tsx": "Displays site branding, quick navigation links, contact info, and a footer attribution block.",
  "frontend/src/components/site/Header.tsx": "Responsive header with logo and navigation, including a mobile sheet menu and smooth scroll links.",
  "frontend/src/components/site/HeroSection.tsx": "Hero section with headline, description, buttons that scroll to sections, and a hero image.",
  "frontend/src/components/site/InquiryListDebug.tsx": "Debug component showing a collapsible table of inquiries fetched from the backend.",
  "frontend/src/components/site/ProductCategories.tsx": "Displays predefined product categories in cards with item lists.",
  "frontend/src/components/site/ScrollToSectionLink.tsx": "Accessible link component that scrolls smoothly to a target section on click or keypress.",
  "frontend/src/components/site/Section.tsx": "Wraps content in a styled section with optional ID and container layout.",
  "frontend/src/components/site/ServicesSection.tsx": "Shows service cards with icons and descriptions, followed by product categories.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInquiryList.ts": "Fetches a list of inquiries from the backend using the current actor.",
  "frontend/src/hooks/useInquirySubmission.ts": "Validates and submits inquiry forms to the backend, managing submission state and errors.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handles login/logout, and loads stored identities.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables for light and dark themes.",
  "frontend/src/lib/serviceInterest.ts": "Defines service interest options and helper functions to map between frontend values and backend enum labels.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider wrappers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugin integrations.",
  "project_state.json": "Describes the project state, features, requirements, and image assets for the NK SYSTECH website."
}