{
  "backend/main.mo": "Motoko canister storing inquiries in a map with submit, list, and filter functions.",
  "feature_evidence.json": "Feature evidence report mapping UI issues and fixes to related frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the roles of major frontend components and utilities.",
  "frontend/index.css": "Global Tailwind styles defining color variables, themes, and base styling.",
  "frontend/index.html": "HTML entry file mounting the React app and loading main.tsx.",
  "frontend/REGRESSION_CHECKS.md": "Manual regression checklist ensuring Contact section buttons display and behave correctly in production.",
  "frontend/src/App.tsx": "Top-level React component composing Header, hero, About, Services, Contact, and Footer sections.",
  "frontend/src/components/site/BrandLogo.tsx": "Logo component showing an image with a fallback NK initials block if loading fails.",
  "frontend/src/components/site/ContactSection.tsx": "Contact section with direct-call and WhatsApp buttons plus an inquiry form using validation and submission hooks.",
  "frontend/src/components/site/Footer.tsx": "Renders the site footer with brand info, quick navigation links, and contact details including owner, phone, email, and address.",
  "frontend/src/components/site/Header.tsx": "Provides a sticky header with brand logo and navigation links, including a mobile menu using a sheet component.",
  "frontend/src/components/site/HeroSection.tsx": "Displays the hero banner with title, description, call‑to‑action buttons, and a featured image, supporting smooth scrolling.",
  "frontend/src/components/site/InquiryListDebug.tsx": "Debug-only component that lists submitted inquiries in a collapsible table using backend data.",
  "frontend/src/components/site/ProductCategories.tsx": "Shows product categories in a grid using cards, each listing related technology items.",
  "frontend/src/components/site/ScrollToSectionLink.tsx": "Custom link component that smooth‑scrolls to a target section on click or keyboard activation.",
  "frontend/src/components/site/Section.tsx": "Wrapper component for page sections adding spacing, container layout, and optional ID.",
  "frontend/src/components/site/ServicesSection.tsx": "Displays a services overview with icons, descriptions, and images inside a styled section layout.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInquiryList.ts": "Fetches all inquiries from the backend actor using React Query, enabled when the actor is ready.",
  "frontend/src/hooks/useInquirySubmission.ts": "Handles inquiry form validation and submission to the backend, exposing status and error state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context/provider and hook for managing Internet Identity authentication state, including loading, login, logout, and status flags.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light/dark themes, plus utility classes and typography adjustments.",
  "frontend/src/lib/serviceInterest.ts": "Provides service interest options and helper functions to map between UI values, labels, and backend ServiceInterest enums.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom theme colors, fonts, sizing, animations, and plugins like typography, container queries, and animate.",
  "project_state.json": "Tracks project metadata, requirements, known issues, and current state for the NK SYSTECH website build."
}