{
  "backend/main.mo": "Motoko canister storing inquiries in a map with submit, list, lookup, and filter functions.",
  "feature_evidence.json": "JSON report describing a feature request to update footer contact info and listing related files and metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend components and configuration files.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Basic HTML entry file that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React component assembling Header, Hero, About, Services, Contact, and Footer sections.",
  "frontend/src/components/site/ContactSection.tsx": "Section with inquiry form, validation, submission logic, and status handling.",
  "frontend/src/components/site/Footer.tsx": "Footer showing brand info, quick links, and owner contact details with icons.",
  "frontend/src/components/site/Header.tsx": "Sticky header with logo, desktop navigation, and mobile sheet menu.",
  "frontend/src/components/site/HeroSection.tsx": "Hero banner with headline, description, Call-to-Action buttons, and hero image.",
  "frontend/src/components/site/InquiryListDebug.tsx": "Expandable debug panel that fetches and displays inquiry records in a table using useInquiryList.",
  "frontend/src/components/site/ProductCategories.tsx": "Renders a grid of product category cards with titles and item lists.",
  "frontend/src/components/site/ScrollToSectionLink.tsx": "Anchor-like component that smoothly scrolls to a target section on click or keypress.",
  "frontend/src/components/site/Section.tsx": "Wrapper component for page sections adding consistent padding and container layout.",
  "frontend/src/components/site/ServicesSection.tsx": "Displays service cards with icons and descriptions and includes the ProductCategories section.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor bound to the current identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInquiryList.ts": "Fetches all inquiries from the backend actor with react-query when enabled.",
  "frontend/src/hooks/useInquirySubmission.ts": "Validates form data and submits an inquiry through the backend actor, tracking status and errors.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading, login, and identity persistence.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables for light and dark themes.",
  "frontend/src/lib/serviceInterest.ts": "Maps service interest values between frontend options and backend enums and returns labels.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, and Internet Identity provider.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, defining content paths, extending theme colors, typography, animations, and loading typography, container-queries, and animate plugins.",
  "project_state.json": "Project metadata describing features and requirements for a responsive NK SYSTECH business website with pages, services, products, theme, contact form, and assets."
}