{
  "backend/main.mo": "Motoko actor storing and managing inquiries with CRUD-style submit and query functions.",
  "feature_evidence.json": "Feature evidence report describing logo replacement requirement and related components.",
  "frontend-file-summaries.txt": "Text file listing summaries of all frontend components and utilities.",
  "frontend/index.css": "Global Tailwind CSS setup defining OKLCH-based theme variables and dark mode values.",
  "frontend/index.html": "HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component assembling the header, sections, and footer into the main layout.",
  "frontend/src/components/site/ContactSection.tsx": "Contact form section handling inquiry submission, validation, and optional debug display.",
  "frontend/src/components/site/Footer.tsx": "Footer showing logo, quick links, and detailed contact information.",
  "frontend/src/components/site/Header.tsx": "Sticky responsive header with logo and navigation menus for desktop and mobile.",
  "frontend/src/components/site/HeroSection.tsx": "Hero banner with headline, description, and buttons that scroll to key sections.",
  "frontend/src/components/site/InquiryListDebug.tsx": "Debug-only collapsible table that loads and displays submitted inquiries using useInquiryList.",
  "frontend/src/components/site/ProductCategories.tsx": "Renders a grid of predefined product categories with titles and item lists.",
  "frontend/src/components/site/ScrollToSectionLink.tsx": "Link component that smoothly scrolls to a target section on click or keyboard activation.",
  "frontend/src/components/site/Section.tsx": "Wrapper section component providing consistent spacing and container layout.",
  "frontend/src/components/site/ServicesSection.tsx": "Displays service cards with icons and descriptions and includes the ProductCategories list.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInquiryList.ts": "Fetches all inquiries from the backend actor with react-query, controlled by an enabled flag.",
  "frontend/src/hooks/useInquirySubmission.ts": "Handles inquiry form validation and submission to the backend, tracking status and errors.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state and actions using AuthClient and a React context provider.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining light/dark theme tokens and utilities.",
  "frontend/src/lib/serviceInterest.ts": "Maps service interest values between UI labels and backend enums and exposes option lists.",
  "frontend/src/main.tsx": "App entry point initializing QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom color variables, typography, container settings, animations, and plugins for styling the frontend.",
  "project_state.json": "Stores the project’s metadata, features, issues, and image requirements for the NK SYSTECH website build."
}