{
  "kind": "build_request",
  "title": "Fix missing Call Now / WhatsApp buttons visibility in Contact section",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Fix the production UI so the \"Call Now\" and \"WhatsApp\" buttons are visible in the Contact section (section id \"contact\") on all screen sizes, without requiring users to interact with hidden/hover-only elements or scroll past unexpected overlays.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5",
          "msg-12",
          "msg-13"
        ],
        "quotes": [
          "theres no button",
          "where the buton",
          "1",
          "build"
        ]
      },
      "acceptanceCriteria": [
        "On the deployed site, navigating to the Contact section shows a clearly visible \"Contact Us Directly\" area containing both \"Call Now\" and \"WhatsApp\" buttons.",
        "Buttons are visible and usable on mobile and desktop breakpoints (e.g., small screens show stacked buttons; larger screens can show side-by-side).",
        "Buttons are not obscured by the sticky header or any overlapping container, and do not require extra scrolling inside a nested container to appear."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Ensure the direct-contact buttons use the exact expected destinations for NK SYSTECH: Call Now uses \"tel:9080250925\" and WhatsApp uses \"https://wa.me/919080250925\" and opens in a new tab/window with safe rel attributes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5",
          "msg-12"
        ],
        "quotes": [
          "The Call Now and WhatsApp buttons are on your Contact page.",
          "theres no button",
          "build"
        ]
      },
      "acceptanceCriteria": [
        "The \"Call Now\" button link href is exactly \"tel:9080250925\".",
        "The \"WhatsApp\" button link href is exactly \"https://wa.me/919080250925\".",
        "The WhatsApp link uses target=\"_blank\" and rel includes \"noopener noreferrer\".",
        "Clicking each button performs the expected behavior in a browser (initiates a call on devices that support tel links; opens WhatsApp chat link in a new tab)."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Add a lightweight UI-level regression check (manual or automated) to verify the Contact section renders the direct-contact buttons in production builds, so the issue does not reoccur in future deployments.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-12",
          "msg-13"
        ],
        "quotes": [
          "theres no button",
          "1",
          "build"
        ]
      },
      "acceptanceCriteria": [
        "A documented verification step exists for production build output/preview that confirms the \"Call Now\" and \"WhatsApp\" buttons are present in the Contact section.",
        "The verification explicitly checks for the presence of both button labels in the rendered page and confirms the links match the required href values."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/components/ui and the immutable hook/entry files listed in SYSTEM_CONTEXT must not be edited; compose existing components instead.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Do not change the phone number (must remain 9080250925) or the WhatsApp number format (must remain https://wa.me/919080250925).",
    "Do not move the buttons to a different section of the site; only ensure they are visible and working in the Contact section as intended.",
    "Do not add new backend functionality for calling or WhatsApp."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}