{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore visible Call Now / WhatsApp buttons in Contact section across breakpoints",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Ensure the Contact section (id \"contact\") always displays the \"Contact Us Directly\" area with visible, unobscured Call Now and WhatsApp buttons across screen sizes.",
      "acceptanceCriteria": [
        "On the deployed site, navigating to the Contact section shows a clearly visible \"Contact Us Directly\" area containing both \"Call Now\" and \"WhatsApp\" buttons.",
        "Buttons are visible and usable on mobile and desktop breakpoints (e.g., small screens show stacked buttons; larger screens can show side-by-side).",
        "Buttons are not obscured by the sticky header or any overlapping container, and do not require extra scrolling inside a nested container to appear."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/site/Section.tsx",
          "operation": "modify",
          "description": "Add scroll-offset-safe spacing (e.g., Tailwind scroll margin classes) to section wrappers so scrolling to \"#contact\" does not place the top content under the sticky header in production builds."
        },
        {
          "path": "frontend/src/components/site/ContactSection.tsx",
          "operation": "modify",
          "description": "Adjust the \"Contact Us Directly\" container/layout to guarantee visibility on all breakpoints (e.g., ensure no accidental clipping/overlap, keep buttons stacked on small screens and side-by-side on larger screens). Use existing shadcn/ui components (e.g., Button, Card) as composed building blocks; Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Confirm direct-contact buttons use the exact tel/WhatsApp destinations with safe link attributes.",
      "acceptanceCriteria": [
        "The \"Call Now\" button link href is exactly \"tel:9080250925\".",
        "The \"WhatsApp\" button link href is exactly \"https://wa.me/919080250925\".",
        "The WhatsApp link uses target=\"_blank\" and rel includes \"noopener noreferrer\".",
        "Clicking each button performs the expected behavior in a browser (initiates a call on devices that support tel links; opens WhatsApp chat link in a new tab)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/site/ContactSection.tsx",
          "operation": "modify",
          "description": "Ensure the rendered anchors for \"Call Now\" and \"WhatsApp\" use the exact required href values. Ensure WhatsApp uses target=\"_blank\" and rel includes \"noopener noreferrer\". Add stable UI identifiers (e.g., data-testid) for both buttons/links to support future checks. Use existing shadcn/ui Button composition; Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Add a lightweight UI-level regression check (documented) to verify the Contact section renders both direct-contact buttons with correct labels and href values in production builds.",
      "acceptanceCriteria": [
        "A documented verification step exists for production build output/preview that confirms the \"Call Now\" and \"WhatsApp\" buttons are present in the Contact section.",
        "The verification explicitly checks for the presence of both button labels in the rendered page and confirms the links match the required href values."
      ],
      "file_operations": [
        {
          "path": "frontend/REGRESSION_CHECKS.md",
          "operation": "create",
          "description": "Document a production-build verification procedure (build + preview) that navigates to the Contact section and confirms: (1) both button labels \"Call Now\" and \"WhatsApp\" are visible, and (2) their link href values are exactly \"tel:9080250925\" and \"https://wa.me/919080250925\" respectively (including target/rel expectations for WhatsApp)."
        },
        {
          "path": "frontend/src/components/site/ContactSection.tsx",
          "operation": "modify",
          "description": "Ensure the direct-contact buttons have stable selectors (e.g., data-testid or aria-label) and clearly rendered text so the documented regression check can reliably validate presence and hrefs. Use existing shadcn/ui components as composed building blocks; Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}